
# Efinity Interface Designer SDC
# Version: 2022.2.322.2.14
# Date: 2023-03-16 09:49

# Copyright (C) 2017 - 2022 Efinix Inc. All rights reserved.

# Device: Ti180M484
# Project: edge_vision_soc
# Timing Model: C4 (preliminary)
#               NOTE: The timing data is not final

# PLL Constraints
#################
create_clock -period 10.0000 mipi_clk
create_clock -period 10.0000 i_pixel_clk
create_clock -period 10.0000 rx_cfgclk
create_clock -period 10.0000 i_sys_clk
create_clock -period 10.0000 i_axi0_mem_clk
create_clock -period 40.0000 i_sys_clk_25mhz
create_clock -period 4.0000 i_soc_clk
create_clock -period 6.7340 i_hdmi_clk_148p5MHz
create_clock -period 7.5008 pll_ddr_CLKOUT0

create_clock -period 6.4000 [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS}]
create_clock -period 50 [get_ports {jtag_inst1_TCK}]

set_clock_groups -exclusive -group {i_hdmi_clk_148p5MHz} -group {i_soc_clk} -group {i_axi0_mem_clk} -group {jtag_inst1_TCK} -group {i_pixel_clk} -group {i_sys_clk} -group {rx_cfgclk} -group {mipi_clk} -group {i_sys_clk_25mhz} -group {mipi_dphy_rx_inst1_WORD_CLKOUT_HS}


# GPIO Constraints
####################
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~333~20}] -max 0.691 [get_ports {i_cam_scl}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~333~20}] -min 0.461 [get_ports {i_cam_scl}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~333~21}] -max 0.061 [get_ports {o_cam_scl_oe}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~333~21}] -min -0.026 [get_ports {o_cam_scl_oe}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~333~22}] -max 0.691 [get_ports {i_cam_sda}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~333~22}] -min 0.461 [get_ports {i_cam_sda}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~333~23}] -max 0.061 [get_ports {o_cam_sda_oe}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~333~23}] -min -0.026 [get_ports {o_cam_sda_oe}]

# MIPI DPHY RX Constraints
#####################################
#create_clock -period 6.4000 [get_ports {mipi_dphy_rx_inst1_LP_CLK}]
#create_clock -period 6.4000 [get_ports {mipi_dphy_rx_inst1_ESC_LAN0_CLK}]
#create_clock -period 6.4000 [get_ports {mipi_dphy_rx_inst1_ESC_LAN1_CLK}]
set_output_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 0.835 [get_ports {mipi_dphy_rx_inst1_RST0_N}]
set_output_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 0.089 [get_ports {mipi_dphy_rx_inst1_RST0_N}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -max 4.343 [get_ports {mipi_dphy_rx_inst1_RX_DATA_ESC[*]}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -min 2.895 [get_ports {mipi_dphy_rx_inst1_RX_DATA_ESC[*]}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -max 4.039 [get_ports {mipi_dphy_rx_inst1_RX_LPDT_ESC}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -min 2.693 [get_ports {mipi_dphy_rx_inst1_RX_LPDT_ESC}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -max 3.907 [get_ports {mipi_dphy_rx_inst1_RX_TRIGGER_ESC[3] mipi_dphy_rx_inst1_RX_TRIGGER_ESC[2] mipi_dphy_rx_inst1_RX_TRIGGER_ESC[1] mipi_dphy_rx_inst1_RX_TRIGGER_ESC[0]}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -min 2.605 [get_ports {mipi_dphy_rx_inst1_RX_TRIGGER_ESC[3] mipi_dphy_rx_inst1_RX_TRIGGER_ESC[2] mipi_dphy_rx_inst1_RX_TRIGGER_ESC[1] mipi_dphy_rx_inst1_RX_TRIGGER_ESC[0]}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -max 3.387 [get_ports {mipi_dphy_rx_inst1_RX_ULPS_ESC_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -min 2.258 [get_ports {mipi_dphy_rx_inst1_RX_ULPS_ESC_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -max 3.465 [get_ports {mipi_dphy_rx_inst1_RX_VALID_ESC}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN0_CLK -min 2.310 [get_ports {mipi_dphy_rx_inst1_RX_VALID_ESC}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN1_CLK -max 3.783 [get_ports {mipi_dphy_rx_inst1_RX_ULPS_ESC_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_ESC_LAN1_CLK -min 2.522 [get_ports {mipi_dphy_rx_inst1_RX_ULPS_ESC_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.607 [get_ports {mipi_dphy_rx_inst1_ERR_SOT_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.071 [get_ports {mipi_dphy_rx_inst1_ERR_SOT_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.619 [get_ports {mipi_dphy_rx_inst1_ERR_SOT_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.079 [get_ports {mipi_dphy_rx_inst1_ERR_SOT_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.667 [get_ports {mipi_dphy_rx_inst1_ERR_SOT_SYNC_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.112 [get_ports {mipi_dphy_rx_inst1_ERR_SOT_SYNC_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.613 [get_ports {mipi_dphy_rx_inst1_ERR_SOT_SYNC_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.075 [get_ports {mipi_dphy_rx_inst1_ERR_SOT_SYNC_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.627 [get_ports {mipi_dphy_rx_inst1_RX_ACTIVE_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.085 [get_ports {mipi_dphy_rx_inst1_RX_ACTIVE_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.644 [get_ports {mipi_dphy_rx_inst1_RX_ACTIVE_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.096 [get_ports {mipi_dphy_rx_inst1_RX_ACTIVE_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.693 [get_ports {mipi_dphy_rx_inst1_RX_DATA_HS_LAN0[*]}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.128 [get_ports {mipi_dphy_rx_inst1_RX_DATA_HS_LAN0[*]}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.723 [get_ports {mipi_dphy_rx_inst1_RX_DATA_HS_LAN1[*]}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.149 [get_ports {mipi_dphy_rx_inst1_RX_DATA_HS_LAN1[*]}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.723 [get_ports {mipi_dphy_rx_inst1_RX_SKEW_CAL_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.149 [get_ports {mipi_dphy_rx_inst1_RX_SKEW_CAL_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.656 [get_ports {mipi_dphy_rx_inst1_RX_SKEW_CAL_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.104 [get_ports {mipi_dphy_rx_inst1_RX_SKEW_CAL_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.707 [get_ports {mipi_dphy_rx_inst1_RX_SYNC_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.138 [get_ports {mipi_dphy_rx_inst1_RX_SYNC_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.632 [get_ports {mipi_dphy_rx_inst1_RX_SYNC_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.088 [get_ports {mipi_dphy_rx_inst1_RX_SYNC_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.645 [get_ports {mipi_dphy_rx_inst1_RX_VALID_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.097 [get_ports {mipi_dphy_rx_inst1_RX_VALID_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.612 [get_ports {mipi_dphy_rx_inst1_RX_VALID_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.075 [get_ports {mipi_dphy_rx_inst1_RX_VALID_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.647 [get_ports {mipi_dphy_rx_inst1_STOPSTATE_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.098 [get_ports {mipi_dphy_rx_inst1_STOPSTATE_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -max 1.592 [get_ports {mipi_dphy_rx_inst1_STOPSTATE_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst1_WORD_CLKOUT_HS -reference_pin [get_ports {mipi_dphy_rx_inst1_WORD_CLKOUT_HS~CLKOUT~1~38}] -min 1.061 [get_ports {mipi_dphy_rx_inst1_STOPSTATE_LAN1}]


# # MIPI DPHY TX Constraints
# #####################################


# JTAG Constraints
####################
#create_clock -period 50 [get_ports {jtag_inst1_DRCK}]
set_output_delay -clock jtag_inst1_TCK -max 0.117 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min -0.075 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_CAPTURE}]
#set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_RESET}]
#set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_RESET}]
#set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_RUNTEST}]
#set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_RUNTEST}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.243 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.162 [get_ports {jtag_inst1_SEL}]
#set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_UPDATE}]
#set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.337 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.225 [get_ports {jtag_inst1_SHIFT}]

# DDR Constraints
#####################
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 3.675 [get_ports {ddr_inst_ARST_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.000 [get_ports {ddr_inst_ARST_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_ARADDR_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_ARADDR_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_ARAPCMD_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_ARAPCMD_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_ARBURST_0[1] ddr_inst_ARBURST_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_ARBURST_0[1] ddr_inst_ARBURST_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_ARID_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_ARID_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_ARLEN_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_ARLEN_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_ARSIZE_0[2] ddr_inst_ARSIZE_0[1] ddr_inst_ARSIZE_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_ARSIZE_0[2] ddr_inst_ARSIZE_0[1] ddr_inst_ARSIZE_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_ARVALID_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_ARVALID_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_ARLOCK_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_ARLOCK_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_ARQOS_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_ARQOS_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWADDR_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWADDR_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWAPCMD_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.350 [get_ports {ddr_inst_AWAPCMD_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWALLSTRB_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWALLSTRB_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWBURST_0[1] ddr_inst_AWBURST_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWBURST_0[1] ddr_inst_AWBURST_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWCOBUF_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWCOBUF_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWID_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWID_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWLEN_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWLEN_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWSIZE_0[2] ddr_inst_AWSIZE_0[1] ddr_inst_AWSIZE_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWSIZE_0[2] ddr_inst_AWSIZE_0[1] ddr_inst_AWSIZE_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWVALID_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWVALID_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWLOCK_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWLOCK_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWCACHE_0[3] ddr_inst_AWCACHE_0[2] ddr_inst_AWCACHE_0[1] ddr_inst_AWCACHE_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWCACHE_0[3] ddr_inst_AWCACHE_0[2] ddr_inst_AWCACHE_0[1] ddr_inst_AWCACHE_0[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_AWQOS_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_AWQOS_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_BREADY_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_BREADY_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_RREADY_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_RREADY_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_WDATA_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_WDATA_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_WLAST_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_WLAST_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_WSTRB_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_WSTRB_0[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.310 [get_ports {ddr_inst_WVALID_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min -0.130 [get_ports {ddr_inst_WVALID_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.625 [get_ports {ddr_inst_ARREADY_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.750 [get_ports {ddr_inst_ARREADY_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.520 [get_ports {ddr_inst_AWREADY_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.680 [get_ports {ddr_inst_AWREADY_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.520 [get_ports {ddr_inst_BID_0[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.680 [get_ports {ddr_inst_BID_0[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.625 [get_ports {ddr_inst_BRESP_0[1] ddr_inst_BRESP_0[0]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.750 [get_ports {ddr_inst_BRESP_0[1] ddr_inst_BRESP_0[0]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.625 [get_ports {ddr_inst_BVALID_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.750 [get_ports {ddr_inst_BVALID_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.625 [get_ports {ddr_inst_RDATA_0[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.750 [get_ports {ddr_inst_RDATA_0[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.625 [get_ports {ddr_inst_RID_0[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.750 [get_ports {ddr_inst_RID_0[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.625 [get_ports {ddr_inst_RLAST_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.750 [get_ports {ddr_inst_RLAST_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.625 [get_ports {ddr_inst_RRESP_0[1] ddr_inst_RRESP_0[0]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.750 [get_ports {ddr_inst_RRESP_0[1] ddr_inst_RRESP_0[0]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.625 [get_ports {ddr_inst_RVALID_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.750 [get_ports {ddr_inst_RVALID_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -max 2.625 [get_ports {ddr_inst_WREADY_0}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~2~150}] -min 1.750 [get_ports {ddr_inst_WREADY_0}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 3.675 [get_ports {ddr_inst_ARST_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.000 [get_ports {ddr_inst_ARST_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_ARADDR_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_ARADDR_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_ARAPCMD_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_ARAPCMD_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_ARBURST_1[1] ddr_inst_ARBURST_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_ARBURST_1[1] ddr_inst_ARBURST_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_ARID_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_ARID_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_ARLEN_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_ARLEN_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_ARSIZE_1[2] ddr_inst_ARSIZE_1[1] ddr_inst_ARSIZE_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_ARSIZE_1[2] ddr_inst_ARSIZE_1[1] ddr_inst_ARSIZE_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_ARVALID_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_ARVALID_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_ARLOCK_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_ARLOCK_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_ARQOS_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_ARQOS_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWADDR_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWADDR_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWAPCMD_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.350 [get_ports {ddr_inst_AWAPCMD_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWALLSTRB_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWALLSTRB_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWBURST_1[1] ddr_inst_AWBURST_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWBURST_1[1] ddr_inst_AWBURST_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWCOBUF_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWCOBUF_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWID_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWID_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWLEN_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWLEN_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWSIZE_1[2] ddr_inst_AWSIZE_1[1] ddr_inst_AWSIZE_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWSIZE_1[2] ddr_inst_AWSIZE_1[1] ddr_inst_AWSIZE_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWVALID_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWVALID_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWLOCK_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWLOCK_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWCACHE_1[3] ddr_inst_AWCACHE_1[2] ddr_inst_AWCACHE_1[1] ddr_inst_AWCACHE_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWCACHE_1[3] ddr_inst_AWCACHE_1[2] ddr_inst_AWCACHE_1[1] ddr_inst_AWCACHE_1[0]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_AWQOS_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_AWQOS_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_BREADY_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_BREADY_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_RREADY_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_RREADY_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_WDATA_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_WDATA_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_WLAST_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_WLAST_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_WSTRB_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_WSTRB_1[*]}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.310 [get_ports {ddr_inst_WVALID_1}]
set_output_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min -0.130 [get_ports {ddr_inst_WVALID_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.625 [get_ports {ddr_inst_ARREADY_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.750 [get_ports {ddr_inst_ARREADY_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.520 [get_ports {ddr_inst_AWREADY_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.680 [get_ports {ddr_inst_AWREADY_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.520 [get_ports {ddr_inst_BID_1[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.680 [get_ports {ddr_inst_BID_1[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.625 [get_ports {ddr_inst_BRESP_1[1] ddr_inst_BRESP_1[0]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.750 [get_ports {ddr_inst_BRESP_1[1] ddr_inst_BRESP_1[0]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.625 [get_ports {ddr_inst_BVALID_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.750 [get_ports {ddr_inst_BVALID_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.625 [get_ports {ddr_inst_RDATA_1[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.750 [get_ports {ddr_inst_RDATA_1[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.625 [get_ports {ddr_inst_RID_1[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.750 [get_ports {ddr_inst_RID_1[*]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.625 [get_ports {ddr_inst_RLAST_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.750 [get_ports {ddr_inst_RLAST_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.625 [get_ports {ddr_inst_RRESP_1[1] ddr_inst_RRESP_1[0]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.750 [get_ports {ddr_inst_RRESP_1[1] ddr_inst_RRESP_1[0]}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.625 [get_ports {ddr_inst_RVALID_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.750 [get_ports {ddr_inst_RVALID_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -max 2.625 [get_ports {ddr_inst_WREADY_1}]
set_input_delay -clock i_axi0_mem_clk -reference_pin [get_ports {i_axi0_mem_clk~CLKOUT~1~338}] -min 1.750 [get_ports {ddr_inst_WREADY_1}]

# HSIO GPIO Constraints
#########################
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~18~1}] -max 0.263 [get_ports {system_spi_0_io_sclk_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~18~1}] -min -0.140 [get_ports {system_spi_0_io_sclk_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~78~1}] -max 0.263 [get_ports {system_spi_0_io_ss}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~78~1}] -min -0.140 [get_ports {system_spi_0_io_ss}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~202~1}] -max 0.263 [get_ports {system_spi_1_io_sclk_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~202~1}] -min -0.140 [get_ports {system_spi_1_io_sclk_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~114~1}] -max 0.263 [get_ports {system_spi_1_io_ss}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~114~1}] -min -0.140 [get_ports {system_spi_1_io_ss}]
set_input_delay -clock i_sys_clk_25mhz -reference_pin [get_ports {i_sys_clk_25mhz~CLKOUT~333~335}] -max 0.414 [get_ports {i_hdmi_scl}]
set_input_delay -clock i_sys_clk_25mhz -reference_pin [get_ports {i_sys_clk_25mhz~CLKOUT~333~335}] -min 0.276 [get_ports {i_hdmi_scl}]
set_output_delay -clock i_sys_clk_25mhz -reference_pin [get_ports {i_sys_clk_25mhz~CLKOUT~333~337}] -max 0.263 [get_ports {o_hdmi_scl_oe}]
set_output_delay -clock i_sys_clk_25mhz -reference_pin [get_ports {i_sys_clk_25mhz~CLKOUT~333~337}] -min -0.140 [get_ports {o_hdmi_scl_oe}]
set_input_delay -clock i_sys_clk_25mhz -reference_pin [get_ports {i_sys_clk_25mhz~CLKOUT~333~334}] -max 0.414 [get_ports {i_hdmi_sda}]
set_input_delay -clock i_sys_clk_25mhz -reference_pin [get_ports {i_sys_clk_25mhz~CLKOUT~333~334}] -min 0.276 [get_ports {i_hdmi_sda}]
set_output_delay -clock i_sys_clk_25mhz -reference_pin [get_ports {i_sys_clk_25mhz~CLKOUT~333~336}] -max 0.263 [get_ports {o_hdmi_sda_oe}]
set_output_delay -clock i_sys_clk_25mhz -reference_pin [get_ports {i_sys_clk_25mhz~CLKOUT~333~336}] -min -0.140 [get_ports {o_hdmi_sda_oe}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~85~1}] -max 0.414 [get_ports {system_spi_0_io_data_0_read}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~85~1}] -min 0.276 [get_ports {system_spi_0_io_data_0_read}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~87~1}] -max 0.263 [get_ports {system_spi_0_io_data_0_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~87~1}] -min -0.140 [get_ports {system_spi_0_io_data_0_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~87~1}] -max 0.263 [get_ports {system_spi_0_io_data_0_writeEnable}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~87~1}] -min -0.140 [get_ports {system_spi_0_io_data_0_writeEnable}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~86~1}] -max 0.414 [get_ports {system_spi_0_io_data_1_read}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~86~1}] -min 0.276 [get_ports {system_spi_0_io_data_1_read}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~88~1}] -max 0.263 [get_ports {system_spi_0_io_data_1_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~88~1}] -min -0.140 [get_ports {system_spi_0_io_data_1_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~88~1}] -max 0.263 [get_ports {system_spi_0_io_data_1_writeEnable}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~88~1}] -min -0.140 [get_ports {system_spi_0_io_data_1_writeEnable}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~192~1}] -max 0.414 [get_ports {system_spi_1_io_data_0_read}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~192~1}] -min 0.276 [get_ports {system_spi_1_io_data_0_read}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~194~1}] -max 0.263 [get_ports {system_spi_1_io_data_0_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~194~1}] -min -0.140 [get_ports {system_spi_1_io_data_0_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~194~1}] -max 0.263 [get_ports {system_spi_1_io_data_0_writeEnable}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~194~1}] -min -0.140 [get_ports {system_spi_1_io_data_0_writeEnable}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~191~1}] -max 0.414 [get_ports {system_spi_1_io_data_1_read}]
set_input_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~191~1}] -min 0.276 [get_ports {system_spi_1_io_data_1_read}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~193~1}] -max 0.263 [get_ports {system_spi_1_io_data_1_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~193~1}] -min -0.140 [get_ports {system_spi_1_io_data_1_write}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~193~1}] -max 0.263 [get_ports {system_spi_1_io_data_1_writeEnable}]
set_output_delay -clock i_sys_clk -reference_pin [get_ports {i_sys_clk~CLKOUT~193~1}] -min -0.140 [get_ports {system_spi_1_io_data_1_writeEnable}]

# Clockout Interface
######################

